Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: This function will also create all parent directories given in "path" if they do not already exist.
fr: Cette fonction créera aussi tous les répertoires parents indiqués dans le "chemin" s'ils n'existent pas encore.

source: clean up test folders
fr: Nettoie les dossiers de test

source: Returns the size in bytes of a given directory.
fr: Retourne la taille en octets d'un répertoire donné.

source: The directory path to get the size from, e.g.
fr: Le chemin du répertoire dont on veut obtenir la taille.

source: "C:\Windows".
fr: Ex :"C:\Windows".

source: this flag determines the behaviour and result of the function, and can be a combination of the following:
fr: Ce paramètre détermine le comportement et le résultat de la fonction et peut être une combinaison de ce qui suit :

source: 0 = (default)
fr: 0 = (défaut)

source: 1 = Extended mode is On -> returns an array that contains extended information (see Remarks).
fr: 1 = Le mode étendu est activé.Retourne un tableau qui contient les informations étendues (Voir Remarques).

source: 2 = Don't get the size of files in subdirectories (recursive mode is Off)
fr: 2 = Ne prend pas en compte la taille des fichiers des sous répertoires (le mode récursif est désactivé).

source: the sizes that are greater than or equal to zero
fr: Retourne la taille >=0.

source: -1 and sets the @error flag to 1 if the path doesn't exist.
fr: Retourne -1 et @error = 1 si le chemin n'existe pas.

source: If the script is paused then this function is paused too and will only continue when the script continues!
fr: Si le script est mis en pause alors cette fonction est mise en pause également et elle continuera quand le script sera reprit.

source: If you use the extended mode then the array returned from this function is a single dimension array containing the following elements:
fr: Si vous utilisez le mode étendu, alors le tableau retourné par cette fonction est un tableau à 1 dimension contenant les éléments suivants :

source: $aArray[0] = Size
fr: $array[0] = Taille

source: $aArray[1] = Files count
fr: $array[1] = Nombre de fichiers

source: $aArray[2] = Dirs Count
fr: $array[2] = Nombre de répertoires

source: extended mode
fr: mode étendu

source: time in seconds
fr: temps en secondes

source: Moves a directory and all sub-directories and files.
fr: Déplace un répertoire et tous les sous-répertoires et fichiers qu'il contient.

source: e.g."C:\Path1"
fr: Par exemple, "C:\Path1"

source: e.g."C:\Path_Copy"
fr: Par exemple, "C:\Path_Copy"

source: 0 if there is an error moving the directory.
fr: Retourne 0 s'il y a une erreur de déplacement du répertoire.

source: If the source and destination are on different volumes or UNC paths are used then a copy/delete operation will be performed rather than a move.
fr: Si la source et la destination sont sur des volumes différents ou si des chemins UNC sont utilisés alors un copier/supprimer sera effectué au lieu d'un déplacement.

source: If the destination already exists and the overwrite flag is specified then the source directory will be moved inside the destination.
fr: Si la destination existe déjà et que l'indicateur d'écrasement est spécifié, alors le répertoire source sera déplacé à l'intérieur de la destination.

source: Because AutoIt lacks a "DirRename" function, use DirMove() to rename a folder!
fr: Puisque AutoIt n'a pas la fonction "DirRename" , utilisez DirMove() pour renommer un dossier!

source: Deletes a directory/folder.
fr: Supprime un répertoire/dossier.

source: Path of the directory to remove.
fr: Chemin du répertoire à supprimer.

source: Use this flag to specify if you want to delete sub-directories too.
fr: Utilisez ce drapeau pour spécifier si vous voulez également supprimer les sous-répertoires.

source: 0 = (default) deletes the folder, only if it is empty
fr: 0 = (par défaut) supprime le répertoire seulement s'il est vide

source: 1 = remove files and subdirectories (like the DOS DelTree command)
fr: 1 = supprime les fichiers et sous-répertoires (comme la commande DOS Deltree)

source: 0 if there is an error removing the directory (or if directory does not exist).
fr: Retourne 0 s'il y a eu une erreur de suppression du répertoire (ou si le répertoire n'existe pas).

source: Some directory attributes can make the deletion impossible, therefore if this is the case look at FileSetAttrib() to change the attributes of a directory.
fr: Certains attributs du dossier peut rendre la suppression impossible, cependant si c'est le cas, consultez FileSetAttrib() pour changer les attributs d'un répertoire.

source: Delete C:\Test1 and all subdirs and files
fr: Supprimer C :\\ Test1 et tous les sous-répertoires et fichiers

source: Dynamically calls a function at a specific memory address.
fr: Appel dynamique d'une fonction à une adresse mémoire spécifique.

source: Special Note:
fr: Note Spéciale:

source: This is an advanced function.
fr: C'est une fonction avancée.

source: Incorrect use of this function may cause AutoIt to crash.
fr: Une utilisation incorrecte de cette fonction peut bloquer AutoIt.

source: Before using this function make sure DllCall() doesn't do what you need.
fr: Avant d'utiliser cette fonction assurez-vous que DllCall() ne fait pas ce que vous avez besoin.

source: The return type of the function (see below).
fr: Le type de retour de la fonction.

source: The address of a function.
fr: L'adresse de la fonction.

source: If this value is invalid your script will crash!
fr: Si cette valeur n'est pas valide votre script bloquera!

source: [optional]The type of the parameter (see remarks).
fr: [optional] Le type du paramètre (Voir Remarques).

source: [optional]The actual parameter (see remarks).
fr: [optional] Ce paramètre (Voir Remarques).

source: [optional]The type of the nth parameter (see remarks).
fr: [optional] Le type du n-ième paramètre (Voir Remarques).

source: [optional]The actual nth parameter (see remarks).
fr: [optional] Le n-ième paramètre (Voir Remarques).

source: Valid Types are:
fr: Les types valides sont:

source: Details
fr: Détails

source: no value (only valid for return type - equivalent to void in C)
fr: aucune valeur (valide seulement pour le type de retour - équivalent à void en C)

source: an unsigned 8 bit integer
fr: un entier 8 bits non signé

source: a 16 bit integer
fr: un entier 16 bits

source: an unsigned 16 bit integer
fr: un entier 16 bits non signé

source: a 32 bit integer
fr: un entier 32 bits

source: an unsigned 32 bit integer
fr: un entier 32 bits non signé

source: a 64 bit integer
fr: un entier 64 bits

source: an unsigned 64 bit integer
fr: un entier 64 bits non signé

source: a general pointer (void *)
fr: un pointer en général (void *)

source: a window handle (pointer)
fr: un handle de fenêtre (pointeur)

source: an handle (pointer)
fr: un handle (pointeur)

source: a single precision floating point number
fr: un nombre simple précision en virgule flottante

source: a double precision floating point number
fr: un nombre double précision en virgule flottante

source: an integer big enough to hold a pointer when running on x86 or x64 versions of AutoIt.
fr: un entier assez grand pour contenir un pointeur lors de l'exécution des versions x86 ou x64 de AutoIt.

source: an unsigned integer big enough to hold a pointer when running on x86 or x64 versions of AutoIt.
fr: un entier non signé assez grand pour contenir un pointeur lors de l'exécution des versions x86 ou x64 de AutoIt.

source: an ANSI string (a minimum of 65536 chars is allocated).
fr: une chaîne ANSI (un minimum de 65536 caractères sont alloués).

source: a UNICODE wide character string (a minimum of 65536 chars is allocated).
fr: une chaîne de caractères larges UNICODE (un minimum of 65536 caractères sont alloués).

source: structure created with DllStructCreate()
fr: structure créée avec DllStructCreate()

source: Add * to the end of another type to pass it by reference.
fr: Ajouter * à la fin d'un autre type pour le passer en référence.

source: For example "int*" passes a pointer to an "int" type.
fr: Par exemple "int*" passe un pointeur dans un type "int".

source: Conversions from Windows API types to AutoIt types:
fr: Conversions des types Windows API vers les types AutoIt:

source: AutoIt Type
fr: Type AutoIt

source: To use nested structures inside a structure you must re-define the nested structure.
fr: Pour utiliser une structure imbriquée dans une structure, vous devez redéfinir la structure imbriquée.

source: For example, a structure containing 2 POINT structures ("long;long") would be declared as "long;long;long;long".
fr: Par exemple, une structure contenant deux structures POINT ("long;long") serait déclaré comme "long;long;long;long".

source: The first two long values correspond to the first POINT structure and the second two values correspond to the second POINT structure.
fr: Les deux premières valeurs long correspondent à la première structure POINT et la seconde de deux valeurs correspondent à la seconde structure POINT.

source: For more Windows API types see MSDN.
fr: Pour davantage de types de l'API Windows Consultez MSDN .

source: an array.
fr: Retourne un tableau.

source: 2 = unknown "return type",
fr: 2 = type de retour inconnu,

source: 4 = bad number of parameters,
fr: 4 = erreur sur le nombre de paramètres,

source: 5 = bad parameter
fr: 5 = erreur sur un paramètre

source: By default, AutoIt uses the 'stdcall' calling method.
fr: Par défaut, AutoIt utilise la méthode d'appel 'stdcall'.

source: To use the 'cdecl' method place ':cdecl' after the return type.
fr: Pour utiliser la méthode 'cdecl' placer ':cdecl' après le type de retour.

source: If the function call fails then the @error flag is set to non-zero.
fr: Si l'appel de la fonction échoue alors le flag @error <> 0.

source: Otherwise an array is returned that contains the function return value and a copy of all the parameters (including parameters that the function may have modified when passed by reference).
fr: Sinon un tableau est retourné qui contient la valeur de retour de la fonction et une copie de tous les paramètres (y compris les paramètres que la fonction a modifiés lors d'un passage par référence).

source: $return[0] = function return value
fr: $return[0] = valeur de retour de la fonction

source: Enable GUI event mode.
fr: Active le mode événement GUI.

source: Create a simple GUI.
fr: Crée une simple GUI.

source: Register the close event handler.
fr: Crée le gestionnaire de l'événement close.

source: Show the GUI.
fr: Affiche la GUI.

source: Get a pointer to the window's WindowProc().
fr: Obtient un pointeur sur la fenêtre de WindowsProc().

source: Tell the user what is about to happen.
fr: Indique à l'utilisateur ce qui va se passer.

source: Explicitly generate a WM_CLOSE event and pass it directly to the WindowProc().
fr: Explicitement génére un événement WM_CLOSE et le passe directement à WindowProc().

source: This should never be done in a real application (Use _SendMessage() instead) but
fr: Cela ne devrait jamais être fait dans une application réelle (utilisez _SendMessage() à la place), mais

source: it demonstrates how to use the function.
fr: il montre comment utiliser la fonction.

source: Frees a previously created handle created with DllCallbackRegister.
fr: Libère un handle créé précédemment avec DllCallbackRegister.

source: The DllCallback handle, as returned by a previous call to DllCallbackRegister().
fr: Le handle DLLCallback, tel qu'il est retourné par un appel précédent à DllCallbackRegister().

source: Upon termination, AutoIt automatically closes any handles it opened but calling DllCallbackFree() is still a good idea.
fr: En cas de résiliation, AutoIt ferme automatiquement tous les handles ouverts mais utiliser la fonction DllCallbackFree() est toujours une bonne idée.

source: Create callback function.
fr: Crée une fonction de rappel.

source: Call EnumWindows.
fr: Appele EnumWindows.

source: Delete callback function.
fr: Supprime la fonction de rappel.

source: Callback Procedure
fr: Fonction de rappel

source: If the Title is empty or if the window is not visible then continue enumeration.
fr: Si le titre est vide ou si la fenêtre n'est pas visible, alors continuer l'énumération.

source: Cancel/Close button clicked, return 0 to stop enumeration.
fr: Annule / Ferme bouton cliqué, retourne 0 pour arrêter l'énumération.

source: Return 1 to continue enumeration.
fr: Retourne 1 pour continuer l'énumération.

source: Returns the pointer to a callback function that can be passed to the Win32 API.
fr: Retourne le pointeur sur une fonction de rappel qui peut être transmis à l'API Win32.

source: A DllCallback handle returned from DllCallbackRegister().
fr: Un handle DllCallback retourné par DllCallbackRegister().

source: the pointer to the callback function.
fr: Retourne le pointeur de la fonction de rappel.

source: Use DllCallbackGetPtr() to pass the address of a callback function to the Win32 API when using DllCall().
fr: Utilisez DllCallbackGetPtr() pour passer l'adresse d'une fonction de rappel à l'API Win32 en utilisant DllCall().

source: Creates a user-defined DLL Callback function.
fr: Crée une fonction utilisateur de rappel DLL.

source: The name of the User Defined Function to call.
fr: Le nom défini par l'utilisateur de la fonction à appeler.

source: The return type and calling convention of the function (see DllCall).
fr: Le type de retour et de convention d'appel de la fonction (ConsultezDllCall).

source: A semi-colon separated list of parameters that will be passed to this function.
fr: Un point-virgule sépare la liste des paramètres qui seront passés à cette fonction.

source: See Remarks.
fr: Utilise des types DllCall.

source: a dll "handle" to be used with DllCallbackGetPtr() and DllCallbackFree() functions.
fr: Retourne le handle de la DLL pour être utilisé avec les fonctions DllCallbackGetPtr() et DllCallbackFree().

source: 0 if error occurs.
fr: Retourne 0 en cas d'erreur.

source: Uses all DllCall() types except "struct".
fr: Utilisez tous les types de DllCall() excepté "struct".

source: When finished working with a callback, call the DllCallbackFree() function to close it.
fr: Lorsque le travail est terminé avec un rappel, appelez la fonction DllCallbackFree() pour le fermer.

source: AutoIt normally closes all files upon termination, but explicitly calling DllCallbackFree() is still a good idea.
fr: AutoIt ferme normalement tous les fichiers à la résiliation, mais un appel explicite à DllCallbackFree() est toujours une bonne idée.

source: Closes a previously opened DLL.
fr: Ferme une DLL précédemment ouverte.

source: The handle of a dll, as returned by a previous call to DllOpen().
fr: Le handle d'une dll, renvoyé par un précédent appel à DllOpen().

source: Upon termination, AutoIt automatically closes any dlls it opened but calling DllClose() is still a good idea.
fr: Lors de la fermeture du script, AutoIt ferme automatiquement toutes les dlls qu'il a ouvert, mais appeler DllClose() est toujours une bonne idée.

source: Opens a DLL file for use in DllCall.
fr: Ouvre un fichier DLL pour une utilisation dans DllCall.

source: Filename of the DLL file to open.
fr: Nom du fichier DLL à ouvrir.

source: a dll "handle" to be used with subsequent Dll functions.
fr: Retourne un handle de DLL pour utilisation ultérieure avec les fonctions DLL.

source: -1 if error occurs.
fr: Retourne -1 en cas d'erreur.

source: When finished working with a dll, call the DllClose() function to close it.
fr: Lorsque vous avez terminé d'utiliser une DLL, utilisez la fonction DllClose() pour la fermer.

source: AutoIt normally closes all files upon termination, but explicitly calling DllClose() is still a good idea.
fr: Normalement AutoIt ferme tous les fichiers lors de sa fermeture, mais appeler explicitement DllClose() est toujours une bonne idée.

source: Creates a C/C++ style structure to be used in DllCall.
fr: Crée une structure style C/C++ à utiliser dans DllCall.

source: A string representing the structure to create (See Remarks).
fr: Une chaîne représentant la structure à créer ( Voir Remarques).

source: If supplied the struct will not allocate memory but use the pointer supplied.
fr: Si fourni la structure ne sera pas allouée dans la mémoire, mais utilisera le pointeur fourni.

source: a variable for use with DllStruct calls.
fr: Retourne une variable à utiliser dans les appels de DllStruct.

source: 1 = Variable passed to DllStructCreate was not a string.
fr: 1 = La variable passée à DllStructCreate n'était pas une chaîne.

source: 2 = There is an unknown Data Type in the string passed.
fr: 2 = Il y a un type de données inconnu dans la chaîne passée.

source: 3 = Failed to allocate the memory needed for the struct, or Pointer = 0.
fr: 3 = Impossible d'allouer la mémoire nécessaire pour la structure, ou pointeur = 0.

source: 4 = Error allocating memory for the passed string.
fr: 4 = Erreur d'allocation mémoire pour la chaîne passée.

source: 8bit(1byte) unsigned char
fr: caractère non signé 8bit (1 octet)

source: 8bit(1byte) ASCII char
fr: caractère ASCII 8bit (1 octet)

source: 16bit(2byte) UNICODE wide char
fr: caractère large UNICODE 16 bits (2 octets)

source: 16bit(2bytes) signed integer
fr: entier signé 16 bits (2 octets)

source: 16bit(2bytes) unsigned integer
fr: entier non signé 16 bits (2 octets)

source: 32bit(4bytes) signed integer
fr: entier signé 32 bits (4 octets)

source: 32bit(4bytes) unsigned integer
fr: entier non signé 32 bits (4 octets)

source: 64bit(8bytes) signed integer
fr: entier signé 64 bits (8 octets)

source: 64bit(8bytes) unsigned integer
fr: entier non signé 64 bits (8 octets)

source: 32 or 64bit pointer (depending on if the x86 or x64 version of AutoIt is used)
fr: pointeur 32 ou 64 bits (selon que la version x86 ou x64 de AutoIt est utilisée)

source: 32bit(4bytes) floating point
fr: nombre à virgule flottante 32 bits (4 octets)

source: 64bit(8bytes) floating point
fr: nombre à virgule flottante 64 bits (8 octets)

source: 32 or 64bit signed integer (depending on if the x86 or x64 version of AutoIt is used)
fr: entier signé 32 ou 64 bits (en fonction de la version x86 ou x64 de AutoIt)

source: 32 or 64bit unsigned integer (depending on if the x86 or x64 version of AutoIt is used)
fr: entier non signé 32 ou 64 bits (en fonction de la version x86 ou x64 de AutoIt)

source: The following datatypes will be align according to C declaration rules.
fr: Les types de données suivants seront alignés selon les règles de déclaration C.

source: End of the collection datatypes.
fr: Fin de la collection des données.

source: Padding can occurs see below.
fr: L'alignement peut se voir ci-dessous.

source: n bytes boundary where datatype must be aligned.
fr: limite de n octets pour aligner les données.

source: Each data type must be separated by a semi-colon ';'.
fr: Chaque type de données doit être séparé par un point-virgule ';'.

source: Create arrays by adding '[size]' after the data type:
fr: Créer des tableaux en ajoutant '[size]' après le type de données :

source: An elementname can be added similar to a C-style declaration:
fr: Un nom d'élément peut être ajouté comme dans une déclaration de type C:

source: This dataname can be used in place of the element in other DllStruct... functions.
fr: Ce nom de donnée peut être utilisé à la place de l'élément dans d'autres fonctions DllStruct...

source: The dataname must be alphanumeric or an underscore.
fr: Le 'dataname' doit être alphanumérique ou trait de soulignement.

source: If a collection of datatypes is defined as in a "struct{}" in C declaration, the "STRUCT; ...;
fr: Si une collection de types de données est défini comme dans une "struct{ }" d'une déclaration C, "STRUCT;...;

source: ENDSTRUCT;" must be used.
fr: ENDSTRUCT;" doit être utilisé.

source: This needs to be done to respect alignment inside the entire structure creation.
fr: Ceci doit être fait pour respecter l'alignement à l'intérieur de la création de la structure entière.

source: DllStructCreate("int;STRUCT;ptr;int;ENDSTRUCT;int") ; structure is 32 bytes under a Windows 64-bit and 16 under Windows 32-bit
fr: DllStructCreate ("int; STRUCTURES; ptr; int; ENDSTRUCT; int") ; la structure est de 32 octets sous Windows 64-bit et 16 sous Windows 32 bits

source: DllStructCreate("int;ptr;int;int") ; structure is 24 bytes under a Windows 64-bit and 16 under Windows 32-bit
fr: DllStructCreate ("int; ptr; int; int"); la structure est de 24 octets sous Windows 64-bit et 16 sous Windows 32 bits

source: To use a different alignment prefix the structure with the align keyword.
fr: Pour utiliser un préfixe d'alignement différent de la structure avec le mot-clé 'align'.

source: The default value for n is 8.
fr: La valeur par défaut de n est 8.

source: Valid values are 1, 2, 4, 8, and 16.
fr: Les valeurs valides sont 1, 2, 4, 8, et 16.

source: The alignment of a member will be on a boundary that is either a multiple of n or a multiple of the size of the member, whichever is smaller.
fr: L'alignement d'un membre aura une limite qui est soit un multiple de n soit un multiple de la taille du membre, whichever is smaller .

source: This is equivalent to the #pragma pack option with the Microsoft Visual C++ compiler.
fr: Ceci est équivalent à l'option #pragma avec le compilateur Visual C++ de Microsoft.

source: DllStructCreate("short;int") ; structure is 8 bytes, the "int" is at offset 4
fr: DllStructCreate("short;int"); la structure est de 8 octets, le "int" est à l'offset 4

source: DllStructCreate("align 2;short;int") ; structure is 6 bytes, the "int" is at offset 2
fr: DllStructCreate ("align 2;short;int"); la structure est de 6 octets, le "int" est à l'offset 2

source: DllStructCreate("byte;double") ; structure is 16 bytes, the "double" is at offset 8
fr: DllStructCreate("byte;double"); la structure est de 16 octets, le «double» est à l'offset 8

source: DllStructCreate("align 4;byte;double") ; structure is 12 bytes, the "double" is at offset 4
fr: DllStructCreate ("align 4;byte;double" ); la structure est de 12 octets, le «double» est à l'offset 4

source: If a change of alignment is needed "align" can be use before the first element which need to be changed.
fr: Si un changement d'alignement est requis, "align" peut être utilisé avant le premier élément qui doit être changée.

source: "align" or "align 8" leads to default alignment.
fr: "align" ou "align 8" conduit à l'alignement par défaut.

source: To release allocated memory just set the returned variable to 0.
fr: Pour libérer la mémoire allouée juste définir la variable de retour à 0.

source: The following aggregate alignment rules apply:
fr: Les règles d'alignement des ensembles s'appliquent:

source: The alignment of an array is the same as the alignment of one of the elements of the array.
fr: L'alignement d'un tableau est le même que l'alignement de l'un des éléments du tableau.

source: The alignment of the beginning of a structure is the maximum alignment of any individual member.
fr: L'alignement du début de la structure est l'alignement maximal de tous les membres individuels.

source: Each member within the structure is be placed at its proper alignment as defined in the previous table, which require implicit internal padding, depending on the previous member.
fr: Chaque membre au sein de la structure est placée à son bon alignement tel que défini dans le tableau précédent, ce qui nécessite de combler implicitement, selon le membre précédent.

source: Structure size is an integral multiple of its alignment, which requires padding after the last member.
fr: La taille de la structure est un multiple entier de l'alignement, ce qui nécessite de combler après le dernier élément.
